{
	"columnMappings": [
		{
			"sourceSchema": "dbo",
			"sourceTable": "User",
			"sourceColumn": "ID",
			"destinationSchema": "",
			"destinationTable": "",
			"destinationColumn": "",
			"description": "The primary key of the user record. In TM Forum SID, the identifier is generated by the system (e.g., in the party or account table). This source ID is not directly mapped."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "User",
			"sourceColumn": "RoleID",
			"destinationSchema": "mysql",
			"destinationTable": "party_role",
			"destinationColumn": "id",
			"description": "RoleID indicates the role of the user. It maps directly to the identifier of the party role in SID."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "User",
			"sourceColumn": "CultureID",
			"destinationSchema": "",
			"destinationTable": "",
			"destinationColumn": "",
			"description": "CultureID is a reference to a cultural preference. There is no direct equivalent column in the standard TM Forum SID target schema."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "User",
			"sourceColumn": "CurrencyID",
			"destinationSchema": "mysql",
			"destinationTable": "currency",
			"destinationColumn": "id",
			"description": "CurrencyID denotes the user's preferred currency. It is mapped directly to the SID currency table's id column."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "User",
			"sourceColumn": "LanguageID",
			"destinationSchema": "mysql",
			"destinationTable": "language",
			"destinationColumn": "id",
			"description": "LanguageID indicates the preferred language of the user. It maps directly to the SID language identifier."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "User",
			"sourceColumn": "OwnerID",
			"destinationSchema": "mysql",
			"destinationTable": "party",
			"destinationColumn": "id",
			"description": "OwnerID represents the owner of the user account. In the SID model, this is represented by a Party identifier."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "User",
			"sourceColumn": "Account",
			"destinationSchema": "mysql",
			"destinationTable": "account",
			"destinationColumn": "name",
			"description": "The Account field holds the user’s account name. It is mapped to the 'name' field in the Account table of the SID model, representing the unique account identification string."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "User",
			"sourceColumn": "Name",
			"destinationSchema": "mysql",
			"destinationTable": "party_profile",
			"destinationColumn": "name",
			"description": "The Name field contains the full name of the user. It is mapped to the 'name' attribute in the party_profile table in SID, representing the human‐readable name of the party."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "User",
			"sourceColumn": "Password",
			"destinationSchema": "",
			"destinationTable": "",
			"destinationColumn": "",
			"description": "The Password field contains sensitive credential information. TM Forum SID does not generally carry the clear‐text password; authentication credentials are managed separately. Therefore, this field is not mapped."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "User",
			"sourceColumn": "CreatedDate",
			"destinationSchema": "mysql",
			"destinationTable": "party_profile",
			"destinationColumn": "dateCreated",
			"description": "The CreatedDate indicates when the user account was created. It maps to the dateCreated field in party_profile, with conversion from DATETIME to the appropriate string format if necessary."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "User",
			"sourceColumn": "UserStatusTypeID",
			"destinationSchema": "",
			"destinationTable": "",
			"destinationColumn": "",
			"description": "UserStatusTypeID indicates a status type for the user; however, the SID model does not have a direct equivalent for this field, so it is left unmapped."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "User",
			"sourceColumn": "CreditRatingID",
			"destinationSchema": "",
			"destinationTable": "",
			"destinationColumn": "",
			"description": "CreditRatingID is an identifier for the credit rating of the user. The SID model expects credit rating data to be represented descriptively (for example, in a party_credit_profile), but this numeric ID does not map directly. Therefore, it is not mapped."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "User",
			"sourceColumn": "BillGroupID",
			"destinationSchema": "",
			"destinationTable": "",
			"destinationColumn": "",
			"description": "BillGroupID identifies a billing group in the source system. There is no corresponding column in the TM Forum SID target schema; hence, it is left unmapped."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "User",
			"sourceColumn": "PasswordLastChangedDate",
			"destinationSchema": "",
			"destinationTable": "",
			"destinationColumn": "",
			"description": "PasswordLastChangedDate is used for tracking password changes. This detail is related to user authentication and is not represented in the SID data model."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "User",
			"sourceColumn": "ActingOwnerID",
			"destinationSchema": "mysql",
			"destinationTable": "party",
			"destinationColumn": "id",
			"description": "ActingOwnerID indicates a secondary owner (or acting owner) of the user account. It is mapped to the SID party id to signify the owner identity, similar to OwnerID."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "User",
			"sourceColumn": "ExpireDate",
			"destinationSchema": "",
			"destinationTable": "",
			"destinationColumn": "",
			"description": "ExpireDate is the account expiration date. The TM Forum SID model does not have a designated column for user account expiry, so it is not mapped."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "User",
			"sourceColumn": "Current_StatusTypeID",
			"destinationSchema": "",
			"destinationTable": "",
			"destinationColumn": "",
			"description": "Current_StatusTypeID represents the current status type of the user record. There is no direct mapping to a corresponding field in the SID model; SID typically embeds status in the party or account records differently."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "User",
			"sourceColumn": "CreatedBy",
			"destinationSchema": "",
			"destinationTable": "",
			"destinationColumn": "",
			"description": "CreatedBy indicates which user created the record. This auditing detail is not mapped within the SID target schema."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "User",
			"sourceColumn": "ForcePasswordChangeOnNextLogin",
			"destinationSchema": "",
			"destinationTable": "",
			"destinationColumn": "",
			"description": "ForcePasswordChangeOnNextLogin is a flag for the password policy of the user. This specific authentication management feature is not represented in the SID data model."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "User",
			"sourceColumn": "FailedLoginCount",
			"destinationSchema": "",
			"destinationTable": "",
			"destinationColumn": "",
			"description": "FailedLoginCount records the number of failed login attempts. This operational metric is outside the scope of the TM Forum SID data model and therefore is not mapped."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "User",
			"sourceColumn": "LastStatusChangedDate",
			"destinationSchema": "",
			"destinationTable": "",
			"destinationColumn": "",
			"description": "LastStatusChangedDate indicates the timestamp for the last status change of the user. This piece of audit information has no designated equivalent in the SID schema."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "User",
			"sourceColumn": "LastUpdateDate",
			"destinationSchema": "",
			"destinationTable": "",
			"destinationColumn": "",
			"description": "LastUpdateDate shows the most recent update time for the user record. The TM Forum SID model does not include an equivalent last update field, so it is not mapped."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "User",
			"sourceColumn": "EffectiveCancelDate",
			"destinationSchema": "",
			"destinationTable": "",
			"destinationColumn": "",
			"description": "EffectiveCancelDate designates the cancellation effective date for the user account. This detail is specific to account lifecycle management in the source and is not represented in the SID model."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "User",
			"sourceColumn": "InvoiceConfigurationID",
			"destinationSchema": "",
			"destinationTable": "",
			"destinationColumn": "",
			"description": "InvoiceConfigurationID refers to invoicing configuration data. The TM Forum SID model does not include a corresponding field for invoice configuration within the user context."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "User",
			"sourceColumn": "Snapshot_InvoiceConfigurationID",
			"destinationSchema": "",
			"destinationTable": "",
			"destinationColumn": "",
			"description": "Snapshot_InvoiceConfigurationID is used for capturing invoice configuration snapshots and is not mapped to any TM Forum SID field."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "User",
			"sourceColumn": "PCISalt",
			"destinationSchema": "",
			"destinationTable": "",
			"destinationColumn": "",
			"description": "PCISalt is used as part of the password encryption mechanism. It is sensitive security metadata and is handled separately in TM Forum SID; thus, it is not mapped."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "User",
			"sourceColumn": "SalesforceAccountIdentifier",
			"destinationSchema": "",
			"destinationTable": "",
			"destinationColumn": "",
			"description": "SalesforceAccountIdentifier is used for external system integration and has no equivalent in the TM Forum SID model."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "User",
			"sourceColumn": "Consented",
			"destinationSchema": "",
			"destinationTable": "",
			"destinationColumn": "",
			"description": "Consented indicates whether the user provided consent. This detail is related to privacy and data protection and does not have a direct mapping in the SID schema."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "User",
			"sourceColumn": "PasswordEncrypted",
			"destinationSchema": "",
			"destinationTable": "",
			"destinationColumn": "",
			"description": "PasswordEncrypted contains the encrypted form of the user password. As with the plain password field, authentication credentials are managed outside the SID model, so this field is not mapped."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "Contact",
			"sourceColumn": "ID",
			"destinationSchema": "mysql",
			"destinationTable": "party",
			"destinationColumn": "ID",
			"description": "The primary key of the Contact record is used as the unique identifier for the party in the TM Forum SID model. This maps the Contact.ID to the party table's ID field."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "Contact",
			"sourceColumn": "ContactTypeID",
			"destinationSchema": "",
			"destinationTable": "",
			"destinationColumn": "",
			"description": "The ContactTypeID is an application–specific identifier that classifies the type of contact. There is no equivalent field in the TM Forum SID model, so it is not mapped."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "Contact",
			"sourceColumn": "Name",
			"destinationSchema": "mysql",
			"destinationTable": "party_profile",
			"destinationColumn": "name",
			"description": "The Name field, representing the full display name of the contact, maps to the name field in the party_profile table of the SID model which captures the party's user–friendly name."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "Contact",
			"sourceColumn": "Title",
			"destinationSchema": "mysql",
			"destinationTable": "individual_name",
			"destinationColumn": "formOfAddress",
			"description": "The Title (such as Mr., Ms., Dr., etc.) from the Contact record is best represented by the formOfAddress field in the individual_name table, which stores salutations or titles for individuals in the SID model."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "Contact",
			"sourceColumn": "FirstName",
			"destinationSchema": "mysql",
			"destinationTable": "individual_name",
			"destinationColumn": "givenNames",
			"description": "The FirstName value is mapped to the givenNames column in the individual_name table of the SID model, representing the individual's first or given name. If necessary, a type conversion from NVARCHAR to VARCHAR is performed."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "Contact",
			"sourceColumn": "LastName",
			"destinationSchema": "mysql",
			"destinationTable": "individual_name",
			"destinationColumn": "familyNames",
			"description": "The LastName value is mapped to the familyNames column in the individual_name table, capturing the surname of the contact. A type conversion from NVARCHAR to VARCHAR may be applied as needed."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "Contact",
			"sourceColumn": "Company",
			"destinationSchema": "mysql",
			"destinationTable": "organization_name",
			"destinationColumn": "name",
			"description": "The Company field contains the name of the company associated with the contact. In the TM Forum SID model, an organization's legal or trading name is stored in the organization_name table’s name column; thus, this field maps there. Note that in a complete integration, the contact’s company association would be linked to an organization record."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "UserContactConnector",
			"sourceColumn": "ID",
			"destinationSchema": "",
			"destinationTable": "",
			"destinationColumn": "",
			"description": "The 'ID' column is the primary key of the join table in the source system. In the TM Forum SID data model this join table is not explicitly modeled; relationships between users and their contact details are indicated by the foreign keys in the respective party/contact entities. Therefore, this internal identifier is not mapped."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "UserContactConnector",
			"sourceColumn": "UserID",
			"destinationSchema": "mysql",
			"destinationTable": "party",
			"destinationColumn": "ID",
			"description": "The 'UserID' column indicates the identifier for the user in the source system. In the TM Forum SID model, the 'party' table is used to represent an individual or organization. Here, the user is identified by the Party.ID field, so the value is mapped directly. Note that both are ID fields and serve as keys."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "UserContactConnector",
			"sourceColumn": "ContactID",
			"destinationSchema": "mysql",
			"destinationTable": "account_contact",
			"destinationColumn": "ID",
			"description": "The 'ContactID' column identifies the contact information associated with the user in the source system. In the TM Forum SID data model, contact details for a party are maintained in the 'account_contact' table, where the primary key (ID) uniquely identifies a contact record. Thus, ContactID maps to mysql.account_contact.ID."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "ContactType",
			"sourceColumn": "ID",
			"destinationSchema": "",
			"destinationTable": "",
			"destinationColumn": "",
			"description": "The ID field uniquely identifies a contact type in the source system, but TM Forum’s SID data model does not provide a dedicated lookup table for contact type identifiers. Therefore, there is no direct destination column for this value."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "ContactType",
			"sourceColumn": "Name",
			"destinationSchema": "",
			"destinationTable": "",
			"destinationColumn": "",
			"description": "The Name field in dbo.ContactType holds the descriptive label for the contact type (for example, Billing, Email, Service, etc.). In the TM Forum SID data model, contact type information is typically embedded within contact medium specifications or party role definitions, but no single field exists to store a contact type name. Thus, it remains unmapped."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "ContactType",
			"sourceColumn": "OwnerID",
			"destinationSchema": "",
			"destinationTable": "",
			"destinationColumn": "",
			"description": "The OwnerID field indicates the owner of the contact type in the source system. In TM Forum SID, ownership and assignment of roles are modeled at the party or account level, not in a dedicated contact type lookup; hence there is no corresponding target column."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "ContactType",
			"sourceColumn": "BillingContact",
			"destinationSchema": "",
			"destinationTable": "",
			"destinationColumn": "",
			"description": "The BillingContact flag indicates whether the contact type is used for billing purposes. The TM Forum SID schema does not define discrete boolean flags for contact purpose within its reference data; such distinctions are typically managed through business rules or associations. Therefore, this column is not directly mapped."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "ContactType",
			"sourceColumn": "EmailContact",
			"destinationSchema": "",
			"destinationTable": "",
			"destinationColumn": "",
			"description": "The EmailContact flag indicates whether the contact type is used for email purposes. The TM Forum SID data model does not have a dedicated field for this specific contact functionality, so a direct mapping is not available."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "ContactType",
			"sourceColumn": "ServiceContact",
			"destinationSchema": "",
			"destinationTable": "",
			"destinationColumn": "",
			"description": "The ServiceContact field specifies whether the contact type is used for service-related communications. There is no direct equivalent in the TM Forum SID model, as such role or channel designations are handled via other constructs; therefore it remains unmapped."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "ContactType",
			"sourceColumn": "Required",
			"destinationSchema": "",
			"destinationTable": "",
			"destinationColumn": "",
			"description": "The Required flag indicates whether this contact type is mandatory. The TM Forum SID model does not explicitly provide a field to indicate mandatory contact type requirements, so this attribute is not mapped."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "ContactType",
			"sourceColumn": "ReceiveTickets",
			"destinationSchema": "",
			"destinationTable": "",
			"destinationColumn": "",
			"description": "The ReceiveTickets flag signifies whether contacts of this type should receive trouble tickets. The TM Forum SID standard does not include a dedicated field for this ticketing preference in its contact or party models; hence, no mapping is performed."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "ContactType",
			"sourceColumn": "ShowToAddAccount",
			"destinationSchema": "",
			"destinationTable": "",
			"destinationColumn": "",
			"description": "The ShowToAddAccount flag indicates whether the contact type should be displayed during account creation. This functionality is not explicitly modeled in the TM Forum SID data model, so there is no corresponding target column."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "ContactType",
			"sourceColumn": "ShippingContact",
			"destinationSchema": "",
			"destinationTable": "",
			"destinationColumn": "",
			"description": "The ShippingContact flag designates whether the contact type is used for shipping communications. The TM Forum SID model does not have a direct equivalent for this flag; shipping contact details are typically managed as part of address or contact medium specifications, and no single field maps this attribute."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "ContactType",
			"sourceColumn": "SMSContact",
			"destinationSchema": "",
			"destinationTable": "",
			"destinationColumn": "",
			"description": "The SMSContact flag indicates whether the contact type is used for SMS communication. The TM Forum SID data model does not include an individual column for SMS contact type; such detail would ordinarily be embedded within broader contact medium specifications. Therefore, it remains unmapped."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "UserPaymentMethod",
			"sourceColumn": "ID",
			"destinationSchema": "mysql",
			"destinationTable": "payment_method",
			"destinationColumn": "id",
			"description": "The source field 'ID' is the unique key for the user payment method record. In TM Forum SID, it maps directly to the primary key 'id' in the payment_method table."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "UserPaymentMethod",
			"sourceColumn": "UserID",
			"destinationSchema": "mysql",
			"destinationTable": "party",
			"destinationColumn": "id",
			"description": "The 'UserID' in the source identifies the user who owns this payment method. In the SID data model, a user is represented as a Party, so the source UserID maps to the Party's identifier (id) in the party table."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "UserPaymentMethod",
			"sourceColumn": "Value",
			"destinationSchema": "mysql",
			"destinationTable": "payment_method",
			"destinationColumn": "description",
			"description": "The 'Value' column contains the actual payment method details (for example, an account number or token) in textual form. In the SID model, this descriptive information is stored in the 'description' column of the payment_method table. A type conversion from NVARCHAR to VARCHAR is implied."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "UserPaymentMethod",
			"sourceColumn": "PaymentTypeID",
			"destinationSchema": "",
			"destinationTable": "",
			"destinationColumn": "",
			"description": "The PaymentTypeID is a foreign key that indicates the type of payment method in the source system (referencing dbo.PaymentType). However, the TM Forum SID model does not have an explicit separate field for payment type within the payment_method table. Therefore, this column is not mapped to any target column."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "UserPaymentMethod",
			"sourceColumn": "Disabled",
			"destinationSchema": "mysql",
			"destinationTable": "payment_method",
			"destinationColumn": "status",
			"description": "The 'Disabled' field is a Boolean flag indicating whether the payment method is inactive. In the target SID model, the 'status' field in the payment_method table stores the state of the payment method. A conversion is implied so that a true value in 'Disabled' becomes a string such as 'Disabled' (and false as 'Active' or similar) in payment_method.status."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "PaymentType",
			"sourceColumn": "ID",
			"destinationSchema": "mysql",
			"destinationTable": "payment_method",
			"destinationColumn": "ID",
			"description": "The ID field from dbo.PaymentType is the unique identifier for the payment type. In the TM Forum SID model, this is mapped directly as the identifier (ID) of the PaymentMethod record."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "PaymentType",
			"sourceColumn": "Name",
			"destinationSchema": "mysql",
			"destinationTable": "payment_method",
			"destinationColumn": "name",
			"description": "The Name field from dbo.PaymentType, which is a required text value, maps directly to the 'name' column in the PaymentMethod table, providing the human‐readable name of the payment method."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "PaymentType",
			"sourceColumn": "OwnerID",
			"destinationSchema": "mysql",
			"destinationTable": "payment_method",
			"destinationColumn": "party_role_id",
			"description": "The OwnerID field from dbo.PaymentType indicates the owner (typically a party) of the payment type. In TM Forum SID, the PaymentMethod table has a 'party_role_id' field that represents the party responsible for the payment method. Thus, the OwnerID is mapped to party_role_id."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "PaymentType",
			"sourceColumn": "GeneralLedgerID",
			"destinationSchema": "",
			"destinationTable": "",
			"destinationColumn": "",
			"description": "The GeneralLedgerID field refers to a general ledger entry, which is part of accounting details. No corresponding field exists in the standard TM Forum SID model, so it is left unmapped."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "PaymentType",
			"sourceColumn": "PaymentCodeID",
			"destinationSchema": "",
			"destinationTable": "",
			"destinationColumn": "",
			"description": "The PaymentCodeID column holds an internal payment code value that does not have a counterpart in the TM Forum SID data model; therefore, it is not mapped."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "PaymentType",
			"sourceColumn": "PaymentTypeTypeID",
			"destinationSchema": "",
			"destinationTable": "",
			"destinationColumn": "",
			"description": "PaymentTypeTypeID specifies the type of payment type in the source system. The SID model does not include an equivalent descriptive field for this categorization; hence, it is left unmapped."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "PaymentType",
			"sourceColumn": "PaymentTypeDisbursementTypeID",
			"destinationSchema": "",
			"destinationTable": "",
			"destinationColumn": "",
			"description": "PaymentTypeDisbursementTypeID indicates the disbursement type for the payment type. This detailed disbursement classification is not present in the TM Forum SID schema, so it is not mapped."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "PaymentType",
			"sourceColumn": "ECheckProcessorID",
			"destinationSchema": "",
			"destinationTable": "",
			"destinationColumn": "",
			"description": "ECheckProcessorID represents an identifier for an electronic check processor. This processor detail is not modeled in the TM Forum SID standard; therefore, no mapping is performed."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "PaymentType",
			"sourceColumn": "CreditCardTokenProcessorID",
			"destinationSchema": "",
			"destinationTable": "",
			"destinationColumn": "",
			"description": "CreditCardTokenProcessorID identifies the processor handling credit card token transactions. There is no corresponding field in the TM Forum SID data model, so this column is left unmapped."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "PaymentType",
			"sourceColumn": "ECheckTokenProcessorID",
			"destinationSchema": "",
			"destinationTable": "",
			"destinationColumn": "",
			"description": "ECheckTokenProcessorID refers to a token processor for electronic checks. This concept is not represented within the TM Forum SID schema, and is therefore unmapped."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "PaymentType",
			"sourceColumn": "DefaultDetailMessage",
			"destinationSchema": "mysql",
			"destinationTable": "payment_method",
			"destinationColumn": "description",
			"description": "The DefaultDetailMessage field provides a default or detailed message related to the payment type. It is mapped to the 'description' column in the PaymentMethod table by converting the NVARCHAR(255) text to the VARCHAR(255) description field."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "Invoice",
			"sourceColumn": "ID",
			"destinationSchema": "mysql",
			"destinationTable": "customer_bill",
			"destinationColumn": "id",
			"description": "The primary key of the invoice maps to the unique identifier used for customer bills in the TM Forum SID model."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "Invoice",
			"sourceColumn": "UserID",
			"destinationSchema": "mysql",
			"destinationTable": "customer",
			"destinationColumn": "id",
			"description": "The UserID from the invoice represents the customer who is billed. This maps to the customer’s primary key (id) in the SID, representing the billing party."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "Invoice",
			"sourceColumn": "Name",
			"destinationSchema": "",
			"destinationTable": "",
			"destinationColumn": "",
			"description": "The invoice Name is a descriptive title for the invoice, but no equivalent descriptive field exists in the provided SID target schema."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "Invoice",
			"sourceColumn": "Date",
			"destinationSchema": "",
			"destinationTable": "",
			"destinationColumn": "",
			"description": "The 'Date' field in the invoice is ambiguous with CreatedDate. To avoid data redundancy, only CreatedDate is mapped to capture the invoice issuance time. Therefore, this field is not mapped separately."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "Invoice",
			"sourceColumn": "SentDate",
			"destinationSchema": "",
			"destinationTable": "",
			"destinationColumn": "",
			"description": "The SentDate indicates when the invoice was actually dispatched to the customer, but there is no corresponding field in the TM Forum SID target schema."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "Invoice",
			"sourceColumn": "DueDate",
			"destinationSchema": "",
			"destinationTable": "",
			"destinationColumn": "",
			"description": "The DueDate (when payment is due) is not represented by any field in the provided SID target tables."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "Invoice",
			"sourceColumn": "LastCheckedDate",
			"destinationSchema": "",
			"destinationTable": "",
			"destinationColumn": "",
			"description": "LastCheckedDate is used for system verifications and does not have an equivalent field in the TM Forum SID data model."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "Invoice",
			"sourceColumn": "InvoiceStatusTypeID",
			"destinationSchema": "",
			"destinationTable": "",
			"destinationColumn": "",
			"description": "InvoiceStatusTypeID is an internal foreign key indicating the invoice status type; there is no corresponding status reference in the target SID schema provided."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "Invoice",
			"sourceColumn": "ProcessedDate",
			"destinationSchema": "",
			"destinationTable": "",
			"destinationColumn": "",
			"description": "The ProcessedDate indicates when the invoice was handled by the billing process; no matching field is present in the SID target tables."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "Invoice",
			"sourceColumn": "BillRunHistoryID",
			"destinationSchema": "",
			"destinationTable": "",
			"destinationColumn": "",
			"description": "BillRunHistoryID links the invoice to a batch billing run; the TM Forum SID schema provided does not include a corresponding billing run history field."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "Invoice",
			"sourceColumn": "PreviousBalance",
			"destinationSchema": "",
			"destinationTable": "",
			"destinationColumn": "",
			"description": "The PreviousBalance field reflects the balance before the current invoice and does not have a direct counterpart in the provided SID data model."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "Invoice",
			"sourceColumn": "Balance",
			"destinationSchema": "",
			"destinationTable": "",
			"destinationColumn": "",
			"description": "Balance represents the outstanding amount on the invoice, but there is no equivalent field (such as a 'balance' attribute) in the mapped SID target tables."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "Invoice",
			"sourceColumn": "CreatedDate",
			"destinationSchema": "mysql",
			"destinationTable": "document",
			"destinationColumn": "creationTime",
			"description": "The CreatedDate of the invoice indicates when the invoice document was generated. In the TM Forum SID model, invoices can be represented as billing documents, so this field is mapped to the 'creationTime' attribute in the 'document' table, with DATETIME converted to a string format (e.g., ISO 8601)."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "Invoice",
			"sourceColumn": "ClosedDate",
			"destinationSchema": "",
			"destinationTable": "",
			"destinationColumn": "",
			"description": "The ClosedDate marks when the invoice process was completed; however, no equivalent field exists in the provided SID target schema."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "Invoice",
			"sourceColumn": "AutoPayDate",
			"destinationSchema": "",
			"destinationTable": "",
			"destinationColumn": "",
			"description": "AutoPayDate indicates the scheduled date for automatic payment; this information is not captured by any field in the TM Forum SID model as provided."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "Invoice",
			"sourceColumn": "Delivery_BillRunHistoryID",
			"destinationSchema": "",
			"destinationTable": "",
			"destinationColumn": "",
			"description": "Delivery_BillRunHistoryID represents the billing run history related to invoice delivery. There is no corresponding field in the TM Forum SID target schema, so it is not mapped."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "StatementDetails",
			"sourceColumn": "ID",
			"destinationSchema": "mysql",
			"destinationTable": "party_bill",
			"destinationColumn": "ID",
			"description": "The ID field from dbo.StatementDetails is the unique identifier for a billing statement detail record. In TM Forum SID, this is mapped as the primary key of the Party Bill entity."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "StatementDetails",
			"sourceColumn": "StatementID",
			"destinationSchema": "",
			"destinationTable": "",
			"destinationColumn": "",
			"description": "The StatementID field is a foreign key reference to a Statement record in the source system. There is no directly equivalent field in the TM Forum SID model, so this field is not mapped."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "StatementDetails",
			"sourceColumn": "UserID",
			"destinationSchema": "mysql",
			"destinationTable": "party",
			"destinationColumn": "ID",
			"description": "UserID identifies the user related to the billing detail. In the SID model, the Party table represents the legal entity or individual, so this value is mapped to the Party.ID."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "StatementDetails",
			"sourceColumn": "PackageID",
			"destinationSchema": "",
			"destinationTable": "",
			"destinationColumn": "",
			"description": "PackageID indicates the package associated with this billing detail. The TM Forum SID model does not have an equivalent concept for a package in this context, so it is not mapped."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "StatementDetails",
			"sourceColumn": "ServiceID",
			"destinationSchema": "mysql",
			"destinationTable": "service",
			"destinationColumn": "ID",
			"description": "ServiceID is a foreign key that identifies the service for which the billing detail is recorded. This maps directly to the service identifier in the SID model (mysql.service.ID)."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "StatementDetails",
			"sourceColumn": "Amount",
			"destinationSchema": "mysql",
			"destinationTable": "party_bill",
			"destinationColumn": "amount",
			"description": "The Amount field represents the monetary value for the billing statement detail. It maps to the 'amount' field in the Party Bill entity. A type conversion from MONEY in the source to the VARCHAR(255) format in the target may be required."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "StatementDetails",
			"sourceColumn": "Detail",
			"destinationSchema": "",
			"destinationTable": "",
			"destinationColumn": "",
			"description": "The Detail field contains descriptive text regarding the billing statement detail. The TM Forum SID model does not include a corresponding descriptive attribute for billing details, so this field is not mapped."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "StatementDetails",
			"sourceColumn": "PeriodStart",
			"destinationSchema": "",
			"destinationTable": "",
			"destinationColumn": "",
			"description": "PeriodStart indicates the start date of the billing period. The SID model does not explicitly capture a billing period start date in the available tables, so no mapping is provided."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "StatementDetails",
			"sourceColumn": "PeriodEnd",
			"destinationSchema": "",
			"destinationTable": "",
			"destinationColumn": "",
			"description": "PeriodEnd indicates the end date of the billing period. There is no directly corresponding field in the SID data model, so this field is left unmapped."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "StatementDetails",
			"sourceColumn": "Prorated",
			"destinationSchema": "",
			"destinationTable": "",
			"destinationColumn": "",
			"description": "The Prorated flag indicates whether the amount is prorated. This billing-specific attribute does not have a direct equivalent in the TM Forum SID model."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "StatementDetails",
			"sourceColumn": "Credit",
			"destinationSchema": "",
			"destinationTable": "",
			"destinationColumn": "",
			"description": "The Credit flag indicates if the billing detail represents a credit. The TM Forum SID model does not directly capture this credit indicator in a corresponding field, and hence it is not mapped."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "StatementDetails",
			"sourceColumn": "Reversed",
			"destinationSchema": "",
			"destinationTable": "",
			"destinationColumn": "",
			"description": "The Reversed flag shows if the billing statement detail has been reversed. There is no equivalent reversal indicator in the SID schema, so this field is not mapped."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "StatementDetails",
			"sourceColumn": "Date",
			"destinationSchema": "mysql",
			"destinationTable": "applied_customer_billing_rate",
			"destinationColumn": "date",
			"description": "The Date field reflects the billing transaction date in the statement detail. It is mapped to the 'date' attribute in the Applied Customer Billing Rate entity, with a potential conversion from DATETIME to the target's string format."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "StatementDetails",
			"sourceColumn": "UserPackageID",
			"destinationSchema": "",
			"destinationTable": "",
			"destinationColumn": "",
			"description": "UserPackageID is a foreign key referencing a user's package. The TM Forum SID does not incorporate the concept of a package from this billing context, so this field remains unmapped."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "StatementDetails",
			"sourceColumn": "UserServiceID",
			"destinationSchema": "",
			"destinationTable": "",
			"destinationColumn": "",
			"description": "UserServiceID represents a foreign key reference to user-specific service information. There is no direct equivalent in the SID model for user service identifiers, and thus it is not mapped."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "StatementDetails",
			"sourceColumn": "GLCode",
			"destinationSchema": "",
			"destinationTable": "",
			"destinationColumn": "",
			"description": "GLCode is used for general ledger coding in the source system. Since the TM Forum SID schema does not incorporate general ledger code fields, it is not mapped."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "StatementDetails",
			"sourceColumn": "CreatedBy_UserID",
			"destinationSchema": "",
			"destinationTable": "",
			"destinationColumn": "",
			"description": "CreatedBy_UserID identifies the user who created the billing detail. In the SID model, entity creation is generally captured within the Party record without a separate field for creator, so this field is not mapped separately."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "StatementDetails",
			"sourceColumn": "PostingDate",
			"destinationSchema": "mysql",
			"destinationTable": "party_bill",
			"destinationColumn": "PostingDate",
			"description": "The PostingDate field indicates when the billing detail was posted. It is mapped to the PostingDate attribute of the Party Bill entity in the SID model, with necessary conversion from DATETIME to the target format."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "StatementDetails",
			"sourceColumn": "BulkQuantity",
			"destinationSchema": "mysql",
			"destinationTable": "applied_customer_billing_rate",
			"destinationColumn": "quantity",
			"description": "BulkQuantity indicates the quantity associated with the billing statement detail. This is mapped to the 'quantity' field in the Applied Customer Billing Rate entity, with a type conversion from INT to the appropriate format in the target schema."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "StatementDetails",
			"sourceColumn": "AccountingExportStagingID",
			"destinationSchema": "",
			"destinationTable": "",
			"destinationColumn": "",
			"description": "AccountingExportStagingID is a foreign key used for internal export staging in the source system. There is no equivalent field in the TM Forum SID model, so it is not mapped."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "StatementDetails",
			"sourceColumn": "NonRefundable",
			"destinationSchema": "",
			"destinationTable": "",
			"destinationColumn": "",
			"description": "The NonRefundable flag signifies that the billing amount is non-refundable. The SID model does not have a dedicated field for refundability status, leaving this field unmapped."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "StatementDetails",
			"sourceColumn": "UserPackageAttributeAdditionalBillingItemID",
			"destinationSchema": "",
			"destinationTable": "",
			"destinationColumn": "",
			"description": "UserPackageAttributeAdditionalBillingItemID is a foreign key associated with additional billing attributes within a package context. The TM Forum SID model does not provide an equivalent field for these additional billing items, so it is not mapped."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "UserInvoicer",
			"sourceColumn": "ID",
			"destinationSchema": "",
			"destinationTable": "",
			"destinationColumn": "",
			"description": "The 'ID' column is the internal primary key of the UserInvoicer table. In TM Forum SID the relationship instance key is typically system generated and managed internally, so there is no direct corresponding external key in the SID model."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "UserInvoicer",
			"sourceColumn": "UserID",
			"destinationSchema": "mysql",
			"destinationTable": "party",
			"destinationColumn": "id",
			"description": "The 'UserID' column identifies the user for whom the invoicer relationship is defined. In the TM Forum SID model, a business entity or user is represented by a Party. Thus UserID maps to the Party's unique identifier."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "UserInvoicer",
			"sourceColumn": "Invoicer_UserID",
			"destinationSchema": "mysql",
			"destinationTable": "party",
			"destinationColumn": "id",
			"description": "The 'Invoicer_UserID' column indicates the user who is acting as the invoicer. In SID, invoicing responsibilities are associated with a Party. This column maps to the Party.id field representing the invoicer."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "UserInvoicer",
			"sourceColumn": "InvoicerMaster_UserID",
			"destinationSchema": "mysql",
			"destinationTable": "party",
			"destinationColumn": "id",
			"description": "The 'InvoicerMaster_UserID' column represents the master invoicer user reference. This is mapped to the TM Forum SID by associating the master invoicer with the Party identifier (mysql.party.id)."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "UserInvoicer",
			"sourceColumn": "UsageInvoicer_UserID",
			"destinationSchema": "mysql",
			"destinationTable": "party",
			"destinationColumn": "id",
			"description": "The 'UsageInvoicer_UserID' column identifies the user responsible for usage invoicing. In the SID model, the corresponding user is represented by a Party, so this column is mapped to mysql.party.id."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "UserInvoicer",
			"sourceColumn": "TaxInvoicer_UserID",
			"destinationSchema": "mysql",
			"destinationTable": "party",
			"destinationColumn": "id",
			"description": "The 'TaxInvoicer_UserID' column holds the identifier for the user managing tax-related invoicing. It maps to the Party.id field in the TM Forum SID data model to represent that invoicing role."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "BillGroup",
			"sourceColumn": "ID",
			"destinationSchema": "",
			"destinationTable": "",
			"destinationColumn": "",
			"description": "The BillGroup primary key in the source does not have a corresponding entity in the TM Forum SID target schema. In SID, billing group concepts are not represented, so this identifier remains unmapped."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "BillGroup",
			"sourceColumn": "Name",
			"destinationSchema": "",
			"destinationTable": "",
			"destinationColumn": "",
			"description": "The 'Name' field in BillGroup is a descriptive field for the billing group. There is no analogous descriptive attribute in the SID target schema for grouping or bill configuration, so it remains unmapped."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "BillGroup",
			"sourceColumn": "AdvanceInvoiceDays",
			"destinationSchema": "",
			"destinationTable": "",
			"destinationColumn": "",
			"description": "The 'AdvanceInvoiceDays' field indicates the number of days for invoicing in advance. This billing configuration detail is not represented in the TM Forum SID target schema; therefore, it is not mapped."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "BillGroup",
			"sourceColumn": "OwnerID",
			"destinationSchema": "",
			"destinationTable": "",
			"destinationColumn": "",
			"description": "The 'OwnerID' field, which refers to the owner of the BillGroup, has no corresponding owner or party role field in the SID target schema that represents bill grouping. Thus, it is left unmapped."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "BillGroup",
			"sourceColumn": "SortOrder",
			"destinationSchema": "",
			"destinationTable": "",
			"destinationColumn": "",
			"description": "The 'SortOrder' field, used for ordering bill groups in the source system, does not have an equivalent column in the SID target schema because the concept of a bill group and its ordering is not part of TM Forum SID."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "BillGroup",
			"sourceColumn": "BillDay",
			"destinationSchema": "",
			"destinationTable": "",
			"destinationColumn": "",
			"description": "The 'BillDay' field specifies the day on which the billing occurs. TM Forum SID does not include a comparable attribute for a billing group’s designated billing day, so this field is not mapped."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "BillGroup",
			"sourceColumn": "InvoiceCloseTypeID",
			"destinationSchema": "",
			"destinationTable": "",
			"destinationColumn": "",
			"description": "The 'InvoiceCloseTypeID' field is a foreign key to the InvoiceCloseType table in the source system. There is no corresponding Invoice Close Type concept defined in the provided SID target schema; thus, it remains unmapped."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "BillGroup",
			"sourceColumn": "InvoiceDateProcessTypeID",
			"destinationSchema": "",
			"destinationTable": "",
			"destinationColumn": "",
			"description": "The 'InvoiceDateProcessTypeID' field references a process type for invoice dates in the source system. This specific invoice process detail is not represented in the TM Forum SID model, so no mapping is provided."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "BillGroup",
			"sourceColumn": "InvoiceCloseThresholdAmount",
			"destinationSchema": "",
			"destinationTable": "",
			"destinationColumn": "",
			"description": "The 'InvoiceCloseThresholdAmount' field indicates a monetary threshold for when an invoice should be closed. The TM Forum SID target schema does not include a similar configuration parameter for billing thresholds; therefore, it is left unmapped."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "BillGroup",
			"sourceColumn": "UsageBillingTypeID",
			"destinationSchema": "",
			"destinationTable": "",
			"destinationColumn": "",
			"description": "The 'UsageBillingTypeID' field, referencing the type of usage billing, has no analogous attribute in the SID target schema. The SID model does not capture detailed billing type configurations from the source system."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "BillGroup",
			"sourceColumn": "InvoiceDueDateTypeID",
			"destinationSchema": "",
			"destinationTable": "",
			"destinationColumn": "",
			"description": "The 'InvoiceDueDateTypeID' field specifies the type of due date for invoices. There is no matching concept for invoice due date type in the TM Forum SID schema provided, so it is not mapped."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "BillGroup",
			"sourceColumn": "UsageBillDay",
			"destinationSchema": "",
			"destinationTable": "",
			"destinationColumn": "",
			"description": "The 'UsageBillDay' field indicates the billing day for usage charges. The SID target schema does not contain an equivalent attribute for usage billing day within a bill group context, rendering this field unmapped."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "BillGroup",
			"sourceColumn": "InvoiceConfigurationID",
			"destinationSchema": "",
			"destinationTable": "",
			"destinationColumn": "",
			"description": "The 'InvoiceConfigurationID' field refers to the invoice configuration in the source system. The TM Forum SID data model provided does not include a designated table or field for invoice configurations, so no mapping is available."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "BillGroup",
			"sourceColumn": "AutoPay",
			"destinationSchema": "",
			"destinationTable": "",
			"destinationColumn": "",
			"description": "The 'AutoPay' flag indicates whether automatic payment is enabled for the bill group. This specific billing automation detail is not captured in the SID target schema, resulting in no mapping for this column."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "BillGroup",
			"sourceColumn": "PaymentDay",
			"destinationSchema": "",
			"destinationTable": "",
			"destinationColumn": "",
			"description": "The 'PaymentDay' field specifies the day on which payment is scheduled. As with other billing configuration details from BillGroup, there is no corresponding field in the TM Forum SID target schema, so it remains unmapped."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "InvoiceConfiguration",
			"sourceColumn": "ID",
			"destinationSchema": "",
			"destinationTable": "",
			"destinationColumn": "",
			"description": "The InvoiceConfiguration primary key is a system configuration identifier for invoice setup. This configuration entity is not represented in the TM Forum SID data model, so no target mapping is provided."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "InvoiceConfiguration",
			"sourceColumn": "OwnerID",
			"destinationSchema": "mysql",
			"destinationTable": "party",
			"destinationColumn": "ID",
			"description": "The OwnerID field identifies the owner of the invoice configuration. In the SID model, a party represents an organization or individual; therefore, OwnerID is mapped to the party table's ID column."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "InvoiceConfiguration",
			"sourceColumn": "Name",
			"destinationSchema": "mysql",
			"destinationTable": "common_object_info",
			"destinationColumn": "name",
			"description": "The Name field holds a human‐readable name for the invoice configuration. It maps to the 'name' column in the common_object_info table, which is used in SID for generic named objects."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "InvoiceConfiguration",
			"sourceColumn": "InvoiceTemplateID",
			"destinationSchema": "",
			"destinationTable": "",
			"destinationColumn": "",
			"description": "InvoiceTemplateID is a foreign key referencing an invoice template used for generating invoices. This concept is not part of the TM Forum SID data model, so no mapping is provided."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "InvoiceConfiguration",
			"sourceColumn": "Default_InvoiceDeliveryTypeID",
			"destinationSchema": "",
			"destinationTable": "",
			"destinationColumn": "",
			"description": "The Default_InvoiceDeliveryTypeID indicates the default method of invoice delivery. This operational configuration detail is not represented in the TM Forum SID schema."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "InvoiceConfiguration",
			"sourceColumn": "Export",
			"destinationSchema": "",
			"destinationTable": "",
			"destinationColumn": "",
			"description": "The Export flag (a BIT value) indicates whether invoices should be exported. This operational setting is not part of the SID business data model and is therefore unmapped."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "InvoiceConfiguration",
			"sourceColumn": "ExportPath",
			"destinationSchema": "",
			"destinationTable": "",
			"destinationColumn": "",
			"description": "ExportPath specifies the file system path where invoices will be exported. This is an operational detail outside the scope of the TM Forum SID data model."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "InvoiceConfiguration",
			"sourceColumn": "InvoiceCreditTemplateID",
			"destinationSchema": "",
			"destinationTable": "",
			"destinationColumn": "",
			"description": "InvoiceCreditTemplateID refers to a template for credit invoices. Such configuration detail does not have a corresponding element in the SID data model."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "InvoiceConfiguration",
			"sourceColumn": "EmailSubject",
			"destinationSchema": "",
			"destinationTable": "",
			"destinationColumn": "",
			"description": "The EmailSubject field defines the subject line for invoice-related emails. This communication configuration detail is not modeled in the TM Forum SID schema."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "InvoiceConfiguration",
			"sourceColumn": "EmailInvoiceBodyOptionTypeID",
			"destinationSchema": "",
			"destinationTable": "",
			"destinationColumn": "",
			"description": "EmailInvoiceBodyOptionTypeID indicates a particular option for the email body content for invoices. This level of operational email configuration is not represented in the SID model."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "InvoiceConfiguration",
			"sourceColumn": "EmailInvoiceAttachmentOptionTypeID",
			"destinationSchema": "",
			"destinationTable": "",
			"destinationColumn": "",
			"description": "The EmailInvoiceAttachmentOptionTypeID column specifies the type of attachment option for invoice emails. This configuration aspect is not mapped in the TM Forum SID data model."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "InvoiceConfiguration",
			"sourceColumn": "EmailBody",
			"destinationSchema": "",
			"destinationTable": "",
			"destinationColumn": "",
			"description": "EmailBody contains the textual content for invoice emails. It is an operational configuration detail that is not included in the TM Forum SID data model."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "InvoiceConfiguration",
			"sourceColumn": "NoChargeInvoiceDeliveryTypeID",
			"destinationSchema": "",
			"destinationTable": "",
			"destinationColumn": "",
			"description": "NoChargeInvoiceDeliveryTypeID denotes the delivery type for invoices that do not incur a charge. This operational parameter is not reflected in the TM Forum SID schema."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "InvoiceConfiguration",
			"sourceColumn": "InvoiceExportOptionTypeID",
			"destinationSchema": "",
			"destinationTable": "",
			"destinationColumn": "",
			"description": "InvoiceExportOptionTypeID specifies the export option type for invoices. Such export configuration details are outside the scope of the TM Forum SID data model."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "InvoiceConfiguration",
			"sourceColumn": "OwnerEmailSettingsID",
			"destinationSchema": "",
			"destinationTable": "",
			"destinationColumn": "",
			"description": "OwnerEmailSettingsID provides email settings associated with the owner of the invoice configuration. These settings are considered operational configuration details and do not map to any entity in the SID schema."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "InvoiceConfiguration",
			"sourceColumn": "Snapshot_InvoiceTemplateID",
			"destinationSchema": "",
			"destinationTable": "",
			"destinationColumn": "",
			"description": "Snapshot_InvoiceTemplateID indicates a snapshot version of the invoice template. Since invoice template configurations are not represented in SID, this column remains unmapped."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "InvoiceConfiguration",
			"sourceColumn": "CommissionStatementTemplateID",
			"destinationSchema": "",
			"destinationTable": "",
			"destinationColumn": "",
			"description": "CommissionStatementTemplateID refers to the template for generating commission statements. This invoice‐related configuration concept is not modeled in the TM Forum SID data model."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "InvoiceConfiguration",
			"sourceColumn": "CommissionStatement_EmailBodyOptionID",
			"destinationSchema": "",
			"destinationTable": "",
			"destinationColumn": "",
			"description": "CommissionStatement_EmailBodyOptionID specifies the email body option for commission statements. This operational configuration is not captured within the SID schema."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "InvoiceConfiguration",
			"sourceColumn": "CommissionStatementEmailBody",
			"destinationSchema": "",
			"destinationTable": "",
			"destinationColumn": "",
			"description": "CommissionStatementEmailBody contains the body text for commission statement emails. This field is an operational detail and is not represented in the TM Forum SID data model."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "InvoiceConfiguration",
			"sourceColumn": "CommissionStatementEmailSubject",
			"destinationSchema": "",
			"destinationTable": "",
			"destinationColumn": "",
			"description": "CommissionStatementEmailSubject defines the subject for commission statement emails. This configuration detail does not have a corresponding element in the SID model."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "UserStatusType",
			"sourceColumn": "ID",
			"destinationSchema": "",
			"destinationTable": "",
			"destinationColumn": "",
			"description": "The ID column is the primary key for the UserStatusType record in the source. In the TM Forum SID data model provided, there is no dedicated reference or lookup table for user status type, so this key is not mapped."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "UserStatusType",
			"sourceColumn": "Name",
			"destinationSchema": "",
			"destinationTable": "",
			"destinationColumn": "",
			"description": "The Name column holds the descriptive name of the status type. The TM Forum SID data model in the provided output does not include a comparable reference field for user status type names, so this column is unmapped."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "UserStatusType",
			"sourceColumn": "OwnerID",
			"destinationSchema": "",
			"destinationTable": "",
			"destinationColumn": "",
			"description": "OwnerID is a foreign key to an Owner table in the source system. There is no corresponding table or field for Owner in the TM Forum SID target schema provided, so this column is not mapped."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "UserStatusType",
			"sourceColumn": "StatusTypeID",
			"destinationSchema": "",
			"destinationTable": "",
			"destinationColumn": "",
			"description": "StatusTypeID references a separate StatusType table in the source. The TM Forum SID model as provided does not contain a similar classification or lookup for user status type identifiers. Therefore, this column is unmapped."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "UserStatusType",
			"sourceColumn": "ImageURL",
			"destinationSchema": "",
			"destinationTable": "",
			"destinationColumn": "",
			"description": "The ImageURL column contains a URL for an image representing the user status type. The TM Forum SID schema does not include a field for storing image URLs for status types, so this column is not mapped."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "UserStatusType",
			"sourceColumn": "ShowInAccountStatistics",
			"destinationSchema": "",
			"destinationTable": "",
			"destinationColumn": "",
			"description": "ShowInAccountStatistics is a Boolean flag that indicates if the status type should be shown in account statistics. The TM Forum SID target schema does not have an equivalent field for this flag, so this column remains unmapped."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "StatusType",
			"sourceColumn": "ID",
			"destinationSchema": "",
			"destinationTable": "",
			"destinationColumn": "",
			"description": "The 'ID' column in dbo.StatusType represents the unique identifier for a status type. In the TM Forum SID target schema, there is no standalone lookup table that directly stores status type identifiers. Instead, status values are embedded in various entity tables, so this lookup key does not have a direct mapping."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "StatusType",
			"sourceColumn": "Name",
			"destinationSchema": "",
			"destinationTable": "",
			"destinationColumn": "",
			"description": "The 'Name' column in dbo.StatusType contains the descriptive label for the status type. The TM Forum SID data model does not include a specific reference table for status types; status descriptions are typically part of other entities’ attributes. Therefore, there is no direct destination column for this field in the SID target schema."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "CreditRating",
			"sourceColumn": "ID",
			"destinationSchema": "",
			"destinationTable": "",
			"destinationColumn": "",
			"description": "The 'ID' field in dbo.CreditRating is the primary key in the source system. In the TM Forum SID model the unique identity of credit rating definitions is managed internally (for example, via the party_credit_profile key), and there is no separate dedicated external credit rating identifier field. Therefore, this field is not directly mapped."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "CreditRating",
			"sourceColumn": "Name",
			"destinationSchema": "mysql",
			"destinationTable": "party_credit_profile",
			"destinationColumn": "creditRiskRating",
			"description": "The 'Name' field holds the descriptive label of the credit rating (such as 'Excellent', 'Good', etc.). In the TM Forum SID model the party credit profile table has a 'creditRiskRating' column which semantically reflects the credit quality description. A type conversion from NVARCHAR(50) to VARCHAR(255) is assumed."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "CreditRating",
			"sourceColumn": "OwnerID",
			"destinationSchema": "",
			"destinationTable": "",
			"destinationColumn": "",
			"description": "The 'OwnerID' field represents the owner of the credit rating record in the source system. There is no equivalent concept or target column in the TM Forum SID data model for credit rating ownership in the context of party credit profiles. Therefore, this field is not mapped."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "CreditRating",
			"sourceColumn": "SortOrder",
			"destinationSchema": "",
			"destinationTable": "",
			"destinationColumn": "",
			"description": "The 'SortOrder' field indicates a display or ordering priority in the source system. The TM Forum SID data model does not include an equivalent field for ordering credit ratings; hence, this field is not mapped."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "CreditRating",
			"sourceColumn": "Terms",
			"destinationSchema": "",
			"destinationTable": "",
			"destinationColumn": "",
			"description": "The 'Terms' field contains textual terms or conditions associated with the credit rating. The TM Forum SID model, particularly within the party_credit_profile context, does not offer a corresponding descriptive field for credit rating terms. As a result, this field is left unmapped."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "Owner",
			"sourceColumn": "ID",
			"destinationSchema": "mysql",
			"destinationTable": "party",
			"destinationColumn": "ID",
			"description": "The 'ID' column in dbo.Owner is a unique identifier for the owner. In TM Forum’s SID data model, parties are uniquely identified by their 'ID' in the 'mysql.party' table. A direct mapping is applied with an integer type conversion if needed."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "Owner",
			"sourceColumn": "Name",
			"destinationSchema": "mysql",
			"destinationTable": "party_profile",
			"destinationColumn": "name",
			"description": "The 'Name' column in dbo.Owner represents the owner’s descriptive name. In the TM Forum SID model, a party’s detailed descriptive attributes are stored in the party profile. Therefore, the value is mapped to the 'name' column in the 'mysql.party_profile' table, with a type conversion from NVARCHAR to VARCHAR."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "Owner",
			"sourceColumn": "Tree",
			"destinationSchema": "",
			"destinationTable": "",
			"destinationColumn": "",
			"description": "The 'Tree' column in dbo.Owner likely contains hierarchical or structural information. However, no corresponding column exists in the provided TM Forum SID target schema. As such, this column is not mapped."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "UserOwner",
			"sourceColumn": "ID",
			"destinationSchema": "",
			"destinationTable": "",
			"destinationColumn": "",
			"description": "The 'ID' field in dbo.UserOwner is an internal surrogate key used only for the join table and does not have a direct equivalent in the TM Forum SID data model, since SID typically uses composite relationships or its own key generation for associations."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "UserOwner",
			"sourceColumn": "OwnerID",
			"destinationSchema": "mysql",
			"destinationTable": "party",
			"destinationColumn": "ID",
			"description": "The 'OwnerID' field represents the unique identifier of a party designated as the owner. In the TM Forum SID model, parties (such as owners) are represented in the 'mysql.party' table with an 'ID' column, so this is mapped directly."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "UserOwner",
			"sourceColumn": "UserID",
			"destinationSchema": "mysql",
			"destinationTable": "party",
			"destinationColumn": "ID",
			"description": "The 'UserID' field represents the unique identifier of a party designated as the user. In the TM Forum SID model, users are also represented in the 'mysql.party' table by their 'ID'. Although both OwnerID and UserID map to the same target table, they refer to different roles which would be further differentiated by additional associations in a complete implementation."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "UserParent",
			"sourceColumn": "ID",
			"destinationSchema": "",
			"destinationTable": "",
			"destinationColumn": "",
			"description": "The 'ID' column in dbo.UserParent is an internal primary key for the user relationship record. In the TM Forum SID model the relationship between parties is managed via association objects and composite keys, so there is no direct one‐to‐one equivalent field. Therefore, this column is not directly mapped."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "UserParent",
			"sourceColumn": "UserID",
			"destinationSchema": "mysql",
			"destinationTable": "party",
			"destinationColumn": "ID",
			"description": "The 'UserID' column in dbo.UserParent represents the identifier of the user that is part of the relationship. In the TM Forum SID model a user is represented as a Party, and its unique identifier is stored in the party.ID field. Thus, this maps directly, assuming that the source User is modeled as a Party in SID."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "UserParent",
			"sourceColumn": "Parent_UserID",
			"destinationSchema": "",
			"destinationTable": "",
			"destinationColumn": "",
			"description": "The 'Parent_UserID' field identifies the immediate parent of a user in the source system. However, the standard TM Forum SID data model does not include a built‐in representation for hierarchical user relationships between parties. As this relationship information is typically addressed through custom extension or specific business rules outside the core SID, it is not mapped here."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "UserParent",
			"sourceColumn": "Top_UserID",
			"destinationSchema": "",
			"destinationTable": "",
			"destinationColumn": "",
			"description": "The 'Top_UserID' column represents the top-level parent (or head) in the user hierarchy. Since the TM Forum SID model does not natively capture hierarchical relationships between users/parties, there is no corresponding target column in the standard SID tables. Therefore, this field remains unmapped."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "UserPackage",
			"sourceColumn": "ID",
			"destinationSchema": "",
			"destinationTable": "",
			"destinationColumn": "",
			"description": "This column is the primary key for UserPackage and is an identifier. In TM Forum SID the unique key is generated internally, so this field is not mapped to any descriptive SID column."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "UserPackage",
			"sourceColumn": "UserID",
			"destinationSchema": "",
			"destinationTable": "",
			"destinationColumn": "",
			"description": "UserID is a foreign key identifying the user in the source system. It is an ID field and in the SID model, the linking of customers (parties) is handled separately. Thus, it is left unmapped."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "UserPackage",
			"sourceColumn": "PackageID",
			"destinationSchema": "",
			"destinationTable": "",
			"destinationColumn": "",
			"description": "PackageID refers to the identifier of the package offered. As an identifier key from the source, it is not mapped to a descriptive field in the TM Forum SID data model."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "UserPackage",
			"sourceColumn": "Amount",
			"destinationSchema": "mysql",
			"destinationTable": "product_price",
			"destinationColumn": "value",
			"description": "The Amount column represents the monetary cost associated with the user package. In the SID model, product pricing is captured in the product_price table where the 'value' column (as a string) can record this amount. A type conversion from MONEY to string is implied."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "UserPackage",
			"sourceColumn": "CreatedDate",
			"destinationSchema": "",
			"destinationTable": "",
			"destinationColumn": "",
			"description": "CreatedDate indicates when the UserPackage record was created. There is no direct equivalent for a creation timestamp for a subscription in the TM Forum SID target schema; such lifecycle dates are typically embedded in the validity period (validFor) rather than maintained as a separate field."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "UserPackage",
			"sourceColumn": "NextBillDate",
			"destinationSchema": "",
			"destinationTable": "",
			"destinationColumn": "",
			"description": "NextBillDate specifies the next billing date for the subscription. The SID model does not include a direct field for a next billing or scheduled bill date for a customer package subscription, so it is unmapped."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "UserPackage",
			"sourceColumn": "Name",
			"destinationSchema": "",
			"destinationTable": "",
			"destinationColumn": "",
			"description": "Name carries the descriptive name of the user package. In the SID model, product names are maintained in product specifications. However, there is no dedicated field in the SID target schema for a subscription or package instance name distinct from the product offering data structure, so this field is not directly mapped."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "UserPackage",
			"sourceColumn": "StatusTypeID",
			"destinationSchema": "",
			"destinationTable": "",
			"destinationColumn": "",
			"description": "StatusTypeID is an identifier linking to a status type in the source. As an ID field, it does not map to a descriptive field in the SID schema."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "UserPackage",
			"sourceColumn": "Current_StatusTypeID",
			"destinationSchema": "",
			"destinationTable": "",
			"destinationColumn": "",
			"description": "Current_StatusTypeID indicates the current status type by its identifier. Because it is only an ID reference, it is not mapped to any direct descriptive field in the TM Forum SID schema."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "UserPackage",
			"sourceColumn": "Pending",
			"destinationSchema": "",
			"destinationTable": "",
			"destinationColumn": "",
			"description": "Pending is a string flag that may indicate a pending state. There is no corresponding field in the SID model dedicated to such pending status notes for a subscription, so it remains unmapped."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "UserPackage",
			"sourceColumn": "OneTimeAmount",
			"destinationSchema": "",
			"destinationTable": "",
			"destinationColumn": "",
			"description": "OneTimeAmount represents a one-off monetary amount applied to the package. Although pricing information is modeled in the SID schema (for example in product_price), a distinct one-time amount is not separately captured. Therefore, it is left unmapped."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "UserPackage",
			"sourceColumn": "LastStatusChangedDate",
			"destinationSchema": "",
			"destinationTable": "",
			"destinationColumn": "",
			"description": "LastStatusChangedDate reflects the timestamp of the most recent status change for the package. TM Forum SID does not have a dedicated field for status change timestamps on subscription records, so this column is not mapped."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "UserPackage",
			"sourceColumn": "EffectiveDate",
			"destinationSchema": "",
			"destinationTable": "",
			"destinationColumn": "",
			"description": "EffectiveDate indicates when the package subscription becomes effective. In the SID model, business objects use a 'validFor' period to capture effective validity, but there is no dedicated date field for effective start. Therefore, this column is left unmapped."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "UserPackage",
			"sourceColumn": "CanceledDate",
			"destinationSchema": "",
			"destinationTable": "",
			"destinationColumn": "",
			"description": "CanceledDate shows the cancellation date of the package subscription, but the TM Forum SID data model does not provide a dedicated cancellation date field. Hence, it is unmapped."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "UserPackage",
			"sourceColumn": "LastUpdateDate",
			"destinationSchema": "",
			"destinationTable": "",
			"destinationColumn": "",
			"description": "LastUpdateDate records the most recent update timestamp for the UserPackage record. The SID schema does not have a directly corresponding field for tracking last update timestamps on subscription entities; such information is typically embedded in change management or validity period metadata."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "UserPackage",
			"sourceColumn": "BulkQuantity",
			"destinationSchema": "",
			"destinationTable": "",
			"destinationColumn": "",
			"description": "BulkQuantity denotes the quantity of packages purchased in bulk. The SID model does not include a specific field for bulk purchase quantities for subscriptions, so it is not mapped."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "UserPackage",
			"sourceColumn": "EffectiveCancelDate",
			"destinationSchema": "",
			"destinationTable": "",
			"destinationColumn": "",
			"description": "EffectiveCancelDate specifies when the cancellation takes effect. There is no direct counterpart field in the SID target model for this concept, so it remains unmapped."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "UserPackage",
			"sourceColumn": "UserPackageStatusTypeID",
			"destinationSchema": "",
			"destinationTable": "",
			"destinationColumn": "",
			"description": "UserPackageStatusTypeID is an identifier indicating the status type of the user package. Being an ID field, it is not mapped to a descriptive SID column."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "UserPackage",
			"sourceColumn": "UserPackageParentID",
			"destinationSchema": "",
			"destinationTable": "",
			"destinationColumn": "",
			"description": "UserPackageParentID indicates hierarchical relationships between packages via an identifier, so it is not mapped to any descriptive field in the TM Forum SID schema."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "UserPackage",
			"sourceColumn": "CreatedBy_UserID",
			"destinationSchema": "",
			"destinationTable": "",
			"destinationColumn": "",
			"description": "CreatedBy_UserID identifies the user who created the record. As an identifier field, it is not mapped in the SID target schema."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "UserPackage",
			"sourceColumn": "SalesOrderID",
			"destinationSchema": "",
			"destinationTable": "",
			"destinationColumn": "",
			"description": "SalesOrderID is a foreign key referencing the sales order in the source system. In the SID model, such linkages are managed through separate order management entities, and this identifier is not mapped as a descriptive attribute."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "UserPackage",
			"sourceColumn": "RefundOptionID",
			"destinationSchema": "",
			"destinationTable": "",
			"destinationColumn": "",
			"description": "RefundOptionID indicates the refund option chosen for the package. As it is an identifier referencing refund options, and the SID model does not directly map refund option identifiers in this context, it is left unmapped."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "UserService",
			"sourceColumn": "ID",
			"destinationSchema": "mysql",
			"destinationTable": "customer_facing_service",
			"destinationColumn": "id",
			"description": "The primary key of the UserService record. In the TM Forum SID model, a customer‐facing service instance is uniquely identified by the id column in the customer_facing_service table."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "UserService",
			"sourceColumn": "ServiceID",
			"destinationSchema": "mysql",
			"destinationTable": "service",
			"destinationColumn": "id",
			"description": "The ServiceID field refers to the underlying Service for this user service. It maps to the id column of the service table in the TM Forum SID model, representing the unique identifier of the service."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "UserService",
			"sourceColumn": "UserID",
			"destinationSchema": "mysql",
			"destinationTable": "party",
			"destinationColumn": "id",
			"description": "The UserID field is the identifier of the user associated with this service record. In the SID model users are represented as parties; hence it maps to the id column in the party table."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "UserService",
			"sourceColumn": "CreatedDate",
			"destinationSchema": "",
			"destinationTable": "",
			"destinationColumn": "",
			"description": "The CreatedDate field indicates when the UserService record was created. There is no explicit equivalent field for creation timestamp in the provided TM Forum SID target schema; such temporal metadata may be captured in a 'validFor' field or separately managed."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "UserService",
			"sourceColumn": "UserPackageID",
			"destinationSchema": "",
			"destinationTable": "",
			"destinationColumn": "",
			"description": "The UserPackageID denotes the package or grouping of services a user may subscribe to. No directly corresponding concept or column exists in the TM Forum SID target schema, so this field remains unmapped."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "UserService",
			"sourceColumn": "Name",
			"destinationSchema": "",
			"destinationTable": "",
			"destinationColumn": "",
			"description": "The Name field provides a descriptive name for the user service. In the provided TM Forum SID target schema there is no standard attribute for a service instance’s name, so it is not mapped."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "UserService",
			"sourceColumn": "BillTimes",
			"destinationSchema": "",
			"destinationTable": "",
			"destinationColumn": "",
			"description": "BillTimes indicates the number of times billing has occurred. The TM Forum SID data model as provided does not include an attribute for billing frequency count on the service instance, so this field remains unmapped."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "UserService",
			"sourceColumn": "Amount",
			"destinationSchema": "",
			"destinationTable": "",
			"destinationColumn": "",
			"description": "Amount represents a monetary value (charge) associated with the user service. There is no direct financial charge attribute in the TM Forum SID mapping provided; billing amounts are typically distributed across several billing rate and charge objects, so this field is left unmapped."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "UserService",
			"sourceColumn": "Optional",
			"destinationSchema": "",
			"destinationTable": "",
			"destinationColumn": "",
			"description": "The Optional flag specifies whether the service is optional. There is no direct corresponding column for this boolean flag in the TM Forum SID target schema provided."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "UserService",
			"sourceColumn": "OptionalServiceStartDate",
			"destinationSchema": "",
			"destinationTable": "",
			"destinationColumn": "",
			"description": "The OptionalServiceStartDate captures a potential alternate start date for an optional service. The target TM Forum SID schema does not include a field for such an optional start date."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "UserService",
			"sourceColumn": "OptionalTransactionDate",
			"destinationSchema": "",
			"destinationTable": "",
			"destinationColumn": "",
			"description": "The OptionalTransactionDate indicates an alternate transaction date for the service, but there is no equivalent field in the TM Forum SID target schema."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "UserService",
			"sourceColumn": "OptionalServiceBillDate",
			"destinationSchema": "",
			"destinationTable": "",
			"destinationColumn": "",
			"description": "The OptionalServiceBillDate reflects an alternate billing date for the service, which is not directly mapped in the TM Forum SID model provided."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "UserService",
			"sourceColumn": "OneTimeAmount",
			"destinationSchema": "",
			"destinationTable": "",
			"destinationColumn": "",
			"description": "The OneTimeAmount field holds a monetary charge that is applied only once. The TM Forum SID target schema does not offer a corresponding one‐time amount field; such financial details are managed differently within the SID model."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "UserService",
			"sourceColumn": "LastUpdateDate",
			"destinationSchema": "",
			"destinationTable": "",
			"destinationColumn": "",
			"description": "LastUpdateDate records when the UserService record was last modified. No direct equivalent exists in the provided SID target schema; such audit or timestamp information is generally maintained separately."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "UserService",
			"sourceColumn": "CreatedBy_UserID",
			"destinationSchema": "",
			"destinationTable": "",
			"destinationColumn": "",
			"description": "The CreatedBy_UserID field identifies the user who created the record. In the TM Forum SID schema, creator information is not explicitly modeled as a property on the service instance, so this field is not mapped."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "UserService",
			"sourceColumn": "Canceled",
			"destinationSchema": "",
			"destinationTable": "",
			"destinationColumn": "",
			"description": "The Canceled flag indicates whether the user service has been terminated. In the SID model, service state (such as cancellation) is typically reflected in a status attribute, but no explicit 'Canceled' flag is provided; therefore, this field is left unmapped."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "UserService",
			"sourceColumn": "CanceledDate",
			"destinationSchema": "",
			"destinationTable": "",
			"destinationColumn": "",
			"description": "CanceledDate captures the date the service was canceled. There is no direct counterpart for a cancellation date in the provided TM Forum SID target schema."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "UserService",
			"sourceColumn": "RelatedTo_UserServiceID",
			"destinationSchema": "",
			"destinationTable": "",
			"destinationColumn": "",
			"description": "RelatedTo_UserServiceID indicates a self-referencing relation between UserService records. The TM Forum SID model does not specify a relationship column for linking service subscription instances, so this field is unmapped."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "UserService",
			"sourceColumn": "RefundOptionID",
			"destinationSchema": "",
			"destinationTable": "",
			"destinationColumn": "",
			"description": "The RefundOptionID field denotes the selected refund option for the service. The TM Forum SID schema provided does not incorporate a refund option attribute, so this field is not mapped."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "Package",
			"sourceColumn": "ID",
			"destinationSchema": "mysql",
			"destinationTable": "product",
			"destinationColumn": "ID",
			"description": "The Package table’s primary key is mapped to the unique identifier of a Product in the TM Forum SID model. This represents the product’s unique ID."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "Package",
			"sourceColumn": "Name",
			"destinationSchema": "mysql",
			"destinationTable": "product",
			"destinationColumn": "name",
			"description": "The package Name is directly mapped to the product name in the TM Forum SID model."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "Package",
			"sourceColumn": "SKU",
			"destinationSchema": "",
			"destinationTable": "",
			"destinationColumn": "",
			"description": "The SKU (stock keeping unit) is a code from the source system that has no direct equivalent in the SID model. It is therefore not mapped."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "Package",
			"sourceColumn": "OwnerID",
			"destinationSchema": "",
			"destinationTable": "",
			"destinationColumn": "",
			"description": "OwnerID is a reference to the owning party in the source. In TM Forum SID, ownership is expressed via Party relationships but there is no direct column mapping provided here, so it remains unmapped."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "Package",
			"sourceColumn": "Frequency",
			"destinationSchema": "",
			"destinationTable": "",
			"destinationColumn": "",
			"description": "Frequency indicates a recurring interval in the source system. No direct equivalent or field for frequency is defined in the target SID schema, so it is left unmapped."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "Package",
			"sourceColumn": "BaseTimeUnitTypeID",
			"destinationSchema": "",
			"destinationTable": "",
			"destinationColumn": "",
			"description": "BaseTimeUnitTypeID identifies a time unit type in the source, but there is no corresponding field in the TM Forum SID target. It remains unmapped."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "Package",
			"sourceColumn": "Amount",
			"destinationSchema": "mysql",
			"destinationTable": "component_prod_offer_price",
			"destinationColumn": "price",
			"description": "The Amount field (a MONEY value) represents the monetary value of the package. It is mapped to the price attribute in the component product offering price table. A type conversion from MONEY to VARCHAR (or a numeric string) may be required."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "Package",
			"sourceColumn": "CreatedDate",
			"destinationSchema": "",
			"destinationTable": "",
			"destinationColumn": "",
			"description": "CreatedDate captures the timestamp when the package was created. The TM Forum SID model does not provide a direct creation date field on the Product entity; such timestamp information might be maintained in versioning records but is not directly mapped here."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "Package",
			"sourceColumn": "Description",
			"destinationSchema": "mysql",
			"destinationTable": "product",
			"destinationColumn": "description",
			"description": "The free‐text Description is mapped directly to the product description field in the TM Forum SID model."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "Package",
			"sourceColumn": "OneTimeAmount",
			"destinationSchema": "",
			"destinationTable": "",
			"destinationColumn": "",
			"description": "OneTimeAmount represents an optional, one-time charge in the source. There is no direct equivalent in the TM Forum SID schema for a separate one‐time charge amount, so it is unmapped."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "Package",
			"sourceColumn": "InactiveOverride",
			"destinationSchema": "mysql",
			"destinationTable": "product",
			"destinationColumn": "status",
			"description": "The InactiveOverride flag is mapped to the product’s status. A transformation is applied: if InactiveOverride is true, the status is set to 'Inactive'; if false, to 'Active'."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "Package",
			"sourceColumn": "StartDate",
			"destinationSchema": "mysql",
			"destinationTable": "product",
			"destinationColumn": "validFor",
			"description": "StartDate represents the beginning of the period during which the package is valid. In the target, the validFor column is used to capture the overall valid period. This value will be concatenated with the ExpiryDate to form the complete period range."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "Package",
			"sourceColumn": "ExpiryDate",
			"destinationSchema": "mysql",
			"destinationTable": "product",
			"destinationColumn": "validFor",
			"description": "ExpiryDate represents the end of the package’s validity period. It will be combined with the StartDate to form a valid time range in the product’s validFor attribute."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "Package",
			"sourceColumn": "InvoiceIdentifierID",
			"destinationSchema": "",
			"destinationTable": "",
			"destinationColumn": "",
			"description": "InvoiceIdentifierID is an ID reference to an Invoice Identifier in the source system. No corresponding field exists in the TM Forum SID schema for invoice identifiers within the Product offering model, so it is left unmapped."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "Package",
			"sourceColumn": "ShowToUserPortal",
			"destinationSchema": "",
			"destinationTable": "",
			"destinationColumn": "",
			"description": "ShowToUserPortal is a flag indicating whether the package should be displayed on the user portal. This user‐interface display control is not represented in the TM Forum SID data model; therefore, it is not mapped."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "Service",
			"sourceColumn": "ID",
			"destinationSchema": "mysql",
			"destinationTable": "service",
			"destinationColumn": "id",
			"description": "The primary key of the service record. This unique integer maps directly to the 'id' field of the 'service' table in the TM Forum SID schema."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "Service",
			"sourceColumn": "ServiceTypeID",
			"destinationSchema": "mysql",
			"destinationTable": "service",
			"destinationColumn": "service_specification_id",
			"description": "The 'ServiceTypeID' indicates the type of service and is used as a foreign key to the service specification in the TM Forum SID model; therefore, it is mapped to the 'service_specification_id' column in the 'service' table."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "Service",
			"sourceColumn": "Name",
			"destinationSchema": "mysql",
			"destinationTable": "common_object_info",
			"destinationColumn": "name",
			"description": "The 'Name' field, which holds the service’s display name, maps to the 'name' column in the 'common_object_info' table. This table is used for storing common descriptive attributes of objects in the SID model."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "Service",
			"sourceColumn": "OwnerID",
			"destinationSchema": "mysql",
			"destinationTable": "party",
			"destinationColumn": "ID",
			"description": "The 'OwnerID' represents the identifier of the party that owns the service. In the SID schema, the 'party' table holds party identifiers; therefore this field maps directly to the 'ID' column of the 'party' table."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "Service",
			"sourceColumn": "BaseTimeUnitTypeID",
			"destinationSchema": "",
			"destinationTable": "",
			"destinationColumn": "",
			"description": "The 'BaseTimeUnitTypeID' indicates the type of the base time unit used for billing. The TM Forum SID target schema does not provide a corresponding field for time unit type within the mapped tables."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "Service",
			"sourceColumn": "BaseTimeUnit",
			"destinationSchema": "",
			"destinationTable": "",
			"destinationColumn": "",
			"description": "The 'BaseTimeUnit' specifies the numerical measure of the base time unit for billing (e.g., minutes, hours). There is no direct equivalent in the SID model, so it remains unmapped."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "Service",
			"sourceColumn": "CreatedDate",
			"destinationSchema": "",
			"destinationTable": "",
			"destinationColumn": "",
			"description": "The 'CreatedDate' indicates when the service record was created. The target SID schema does not have a clearly corresponding creation timestamp column for service objects."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "Service",
			"sourceColumn": "BaseFee",
			"destinationSchema": "",
			"destinationTable": "",
			"destinationColumn": "",
			"description": "The 'BaseFee' is the monetary base fee for the service. Although financial figures are important, there is no directly equivalent column in the provided SID target schema to capture this fee."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "Service",
			"sourceColumn": "Description",
			"destinationSchema": "mysql",
			"destinationTable": "common_object_info",
			"destinationColumn": "description",
			"description": "The 'Description' field provides detailed information about the service. It directly maps to the 'description' column of the 'common_object_info' table, which stores descriptive text for objects in the SID model."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "Service",
			"sourceColumn": "InvoiceIdentifierID",
			"destinationSchema": "",
			"destinationTable": "",
			"destinationColumn": "",
			"description": "The 'InvoiceIdentifierID' is a service invoice identifier. There is no analogous field in the TM Forum SID target schema for invoice identifiers; hence, it is left unmapped."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "Service",
			"sourceColumn": "Inactive",
			"destinationSchema": "mysql",
			"destinationTable": "service",
			"destinationColumn": "isServiceEnabled",
			"description": "The 'Inactive' flag indicates whether the service is currently inactive. In the target schema, the 'service' table contains an 'isServiceEnabled' boolean. The mapping is inverse: if 'Inactive' is true, then 'isServiceEnabled' should be false, and vice‐versa."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "Service",
			"sourceColumn": "BillingPeriodTypeID",
			"destinationSchema": "",
			"destinationTable": "",
			"destinationColumn": "",
			"description": "The 'BillingPeriodTypeID' denotes the type of billing period for the service. The TM Forum SID data model provided does not include a corresponding field to capture the billing period type, so it is not mapped."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "Service",
			"sourceColumn": "ShowOnTicketTransaction",
			"destinationSchema": "",
			"destinationTable": "",
			"destinationColumn": "",
			"description": "The 'ShowOnTicketTransaction' field indicates whether the service should appear on ticket transactions. This attribute is not represented in the TM Forum SID target schema and is therefore left unmapped."
		},
		{
			"sourceSchema": "dbo",
			"sourceTable": "Service",
			"sourceColumn": "SKU",
			"destinationSchema": "mysql",
			"destinationTable": "common_object_info",
			"destinationColumn": "aliasNameList",
			"description": "The 'SKU' (Stock Keeping Unit) serves as an alternate identifier or alias for the service. It is mapped to the 'aliasNameList' field in the 'common_object_info' table to capture this alternate naming in the SID model."
		}
	]
}
